<?php

namespace App\Utils;

class ResponseMessage {
    public static $message = [
        200000 => "操作成功",
        200001 => "登录成功",
        200002 => "添加成功",
        200003 => "核销成功",
        200004 => "签到成功,请再接再厉",
        200005 => "今日已经签到过了, 明天再来",
        200006 => "签到成功,抽奖次数+1",

        400000 => "参数是必须的",
        400001 => "参数不存在于数据库",
        400002 => "参数数据类型不正确",
        400003 => "参数不存在",
        400004 => "参数已存在",
        400005 => "参数含有非法字符",
        400006 => "参数格式不正确",
        400007 => "用户不存在",
        400008 => "用户已存在",
        400009 => "缺少卡券参数",
        400010 => "未找到此系统配置项",
        400011 => "此活动已被占用",
        400012 => "此商铺未参加任何活动",
        400013 => "单前活动未选取任何卡券奖品",
        400014 => "未有商家参加当前活动",
        400015 => "请填写姓名与电话再领取卡券",
        400016 => "当前所在区域无法参加活动",
        400017 => "没有抽奖次数",
        400018 => "卡券结束时间参数缺失",
        400019 => "重复的回复关键词",
        400020 => "地址参数缺失",
        400021 => "地址数据类型不正确",
        400022 => "地址含有非法字符",
        400023 => "手机号码格式不正确",
        400024 => "手机号码数据类型不正确",
        400025 => "此卡券活动的所属商铺不存在",
        400026 => "此核销人员的所属商铺不存在",
        400027 => "此卡券的所属用户",
        400028 => "商铺不存在",

        401000 => "认证错误",
        401001 => "token未通过验证",
        401002 => "token已过期",
        401003 => "token已被列入黑名单",
        401004 => "令牌已过期，无法再刷新",
        401005 => "微信oauth2认证异常",

        403000 => "无操作权限",

        500000 => "服务器未知错误",
        500001 => "数据库保存失败",
        500002 => "无效的卡券",
        500003 => "该卡券已被核销",
        500004 => "无主的卡券",
        500005 => "核销人员未对应卡券所属商铺",
    ];
}
