export default {
  nameRules: [
    v => !!v || '请填写你的名字',
    v => !!v ? (/^(\w|[\u4e00-\u9fa5])+$/.test(v) || '请不要包含特殊字符') : '',
    v => !!v ? (v.length <= 10 || '名字过长') : '',
  ],
  phoneRules: [
    v => !!v || '请填写你的电话号码',
    v => !!v ?
      (/^(0|86|17951)?(13[0-9]|15[012356789]|166|17[3678]|18[0-9]|14[57])[0-9]{8}$/.test(
        v) || '手机号码格式不正确') : '',
  ],
  locationRules: [
    v => !!v || '地址不能为空',
  ],
  dateRules: [
    v => !!v || '日期不能为空',
  ],
  timeRules: [
    v => !!v || '时刻不能为空',
  ],
  usernameRules: [
    v => !!v || '请填写用户名',
    v => !!v ? (/^(\w|[\u4e00-\u9fa5])+$/.test(v) || '请不要包含特殊字符') : '',
  ],
  passwordRules: [
    v => !!v || '请填写密码',
    v => !!v ? (/^(\w|[\u4e00-\u9fa5])+$/.test(v) || '请不要包含特殊字符') : '',
  ],
};
